perf/results/20260905-183720-after-formula/auth-read.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/auth-read.js
        output: -

     scenarios: (100.00%) 2 scenarios, 150 max VUs, 1m30s max duration (incl. graceful stop):
              * authList: 100 looping VUs for 1m0s (exec: authList, gracefulStop: 30s)
              * myResources: 50 looping VUs for 1m0s (exec: myResources, gracefulStop: 30s)


running (0m01.0s), 150/150 VUs, 4 complete and 0 interrupted iterations
authList      [   1% ] 100 VUs  0m00.9s/1m0s
myResources   [   1% ] 50 VUs   0m00.9s/1m0s

running (0m02.0s), 150/150 VUs, 33 complete and 0 interrupted iterations
authList      [   3% ] 100 VUs  0m01.9s/1m0s
myResources   [   3% ] 50 VUs   0m01.9s/1m0s

running (0m03.0s), 150/150 VUs, 68 complete and 0 interrupted iterations
authList      [   5% ] 100 VUs  0m02.9s/1m0s
myResources   [   5% ] 50 VUs   0m02.9s/1m0s

running (0m04.0s), 150/150 VUs, 95 complete and 0 interrupted iterations
authList      [   6% ] 100 VUs  0m03.9s/1m0s
myResources   [   6% ] 50 VUs   0m03.9s/1m0s

running (0m05.0s), 150/150 VUs, 123 complete and 0 interrupted iterations
authList      [   8% ] 100 VUs  0m04.8s/1m0s
myResources   [   8% ] 50 VUs   0m04.8s/1m0s

running (0m06.0s), 150/150 VUs, 161 complete and 0 interrupted iterations
authList      [  10% ] 100 VUs  0m05.9s/1m0s
myResources   [  10% ] 50 VUs   0m05.9s/1m0s

running (0m07.0s), 150/150 VUs, 189 complete and 0 interrupted iterations
authList      [  11% ] 100 VUs  0m06.9s/1m0s
myResources   [  11% ] 50 VUs   0m06.9s/1m0s

running (0m08.0s), 150/150 VUs, 217 complete and 0 interrupted iterations
authList      [  13% ] 100 VUs  0m07.8s/1m0s
myResources   [  13% ] 50 VUs   0m07.8s/1m0s

running (0m09.0s), 150/150 VUs, 244 complete and 0 interrupted iterations
authList      [  15% ] 100 VUs  0m08.8s/1m0s
myResources   [  15% ] 50 VUs   0m08.9s/1m0s

running (0m10.0s), 150/150 VUs, 276 complete and 0 interrupted iterations
authList      [  16% ] 100 VUs  0m09.8s/1m0s
myResources   [  16% ] 50 VUs   0m09.8s/1m0s

running (0m11.0s), 150/150 VUs, 308 complete and 0 interrupted iterations
authList      [  18% ] 100 VUs  0m10.9s/1m0s
myResources   [  18% ] 50 VUs   0m10.9s/1m0s

running (0m12.0s), 150/150 VUs, 343 complete and 0 interrupted iterations
authList      [  20% ] 100 VUs  0m11.8s/1m0s
myResources   [  20% ] 50 VUs   0m11.9s/1m0s

running (0m13.0s), 150/150 VUs, 368 complete and 0 interrupted iterations
authList      [  21% ] 100 VUs  0m12.9s/1m0s
myResources   [  21% ] 50 VUs   0m12.9s/1m0s

running (0m14.0s), 150/150 VUs, 389 complete and 0 interrupted iterations
authList      [  23% ] 100 VUs  0m13.8s/1m0s
myResources   [  23% ] 50 VUs   0m13.8s/1m0s

running (0m15.0s), 150/150 VUs, 415 complete and 0 interrupted iterations
authList      [  25% ] 100 VUs  0m14.8s/1m0s
myResources   [  25% ] 50 VUs   0m14.8s/1m0s

running (0m16.0s), 150/150 VUs, 447 complete and 0 interrupted iterations
authList      [  26% ] 100 VUs  0m15.8s/1m0s
myResources   [  26% ] 50 VUs   0m15.8s/1m0s

running (0m17.0s), 150/150 VUs, 475 complete and 0 interrupted iterations
authList      [  28% ] 100 VUs  0m16.9s/1m0s
myResources   [  28% ] 50 VUs   0m16.9s/1m0s

running (0m18.0s), 150/150 VUs, 503 complete and 0 interrupted iterations
authList      [  30% ] 100 VUs  0m17.9s/1m0s
myResources   [  30% ] 50 VUs   0m17.9s/1m0s

running (0m19.0s), 150/150 VUs, 523 complete and 0 interrupted iterations
authList      [  31% ] 100 VUs  0m18.9s/1m0s
myResources   [  31% ] 50 VUs   0m18.9s/1m0s

running (0m20.0s), 150/150 VUs, 558 complete and 0 interrupted iterations
authList      [  33% ] 100 VUs  0m19.8s/1m0s
myResources   [  33% ] 50 VUs   0m19.8s/1m0s

running (0m21.0s), 150/150 VUs, 594 complete and 0 interrupted iterations
authList      [  35% ] 100 VUs  0m20.8s/1m0s
myResources   [  35% ] 50 VUs   0m20.8s/1m0s

running (0m22.0s), 150/150 VUs, 626 complete and 0 interrupted iterations
authList      [  36% ] 100 VUs  0m21.9s/1m0s
myResources   [  36% ] 50 VUs   0m21.9s/1m0s

running (0m23.0s), 150/150 VUs, 664 complete and 0 interrupted iterations
authList      [  38% ] 100 VUs  0m22.8s/1m0s
myResources   [  38% ] 50 VUs   0m22.8s/1m0s

running (0m24.0s), 150/150 VUs, 691 complete and 0 interrupted iterations
authList      [  40% ] 100 VUs  0m23.8s/1m0s
myResources   [  40% ] 50 VUs   0m23.8s/1m0s

running (0m25.0s), 150/150 VUs, 720 complete and 0 interrupted iterations
authList      [  41% ] 100 VUs  0m24.9s/1m0s
myResources   [  41% ] 50 VUs   0m24.9s/1m0s

running (0m26.0s), 150/150 VUs, 753 complete and 0 interrupted iterations
authList      [  43% ] 100 VUs  0m25.8s/1m0s
myResources   [  43% ] 50 VUs   0m25.8s/1m0s

running (0m27.0s), 150/150 VUs, 787 complete and 0 interrupted iterations
authList      [  45% ] 100 VUs  0m26.9s/1m0s
myResources   [  45% ] 50 VUs   0m26.9s/1m0s

running (0m28.0s), 150/150 VUs, 815 complete and 0 interrupted iterations
authList      [  46% ] 100 VUs  0m27.9s/1m0s
myResources   [  46% ] 50 VUs   0m27.9s/1m0s

running (0m29.0s), 150/150 VUs, 843 complete and 0 interrupted iterations
authList      [  48% ] 100 VUs  0m28.9s/1m0s
myResources   [  48% ] 50 VUs   0m28.9s/1m0s

running (0m30.0s), 150/150 VUs, 871 complete and 0 interrupted iterations
authList      [  50% ] 100 VUs  0m29.8s/1m0s
myResources   [  50% ] 50 VUs   0m29.8s/1m0s

running (0m31.0s), 150/150 VUs, 902 complete and 0 interrupted iterations
authList      [  51% ] 100 VUs  0m30.8s/1m0s
myResources   [  51% ] 50 VUs   0m30.8s/1m0s

running (0m32.0s), 150/150 VUs, 932 complete and 0 interrupted iterations
authList      [  53% ] 100 VUs  0m31.9s/1m0s
myResources   [  53% ] 50 VUs   0m31.9s/1m0s

running (0m33.0s), 150/150 VUs, 966 complete and 0 interrupted iterations
authList      [  55% ] 100 VUs  0m32.9s/1m0s
myResources   [  55% ] 50 VUs   0m32.9s/1m0s

running (0m34.0s), 150/150 VUs, 992 complete and 0 interrupted iterations
authList      [  56% ] 100 VUs  0m33.9s/1m0s
myResources   [  56% ] 50 VUs   0m33.9s/1m0s

running (0m35.0s), 150/150 VUs, 1017 complete and 0 interrupted iterations
authList      [  58% ] 100 VUs  0m34.9s/1m0s
myResources   [  58% ] 50 VUs   0m34.9s/1m0s

running (0m36.0s), 150/150 VUs, 1051 complete and 0 interrupted iterations
authList      [  60% ] 100 VUs  0m35.8s/1m0s
myResources   [  60% ] 50 VUs   0m35.8s/1m0s

running (0m37.0s), 150/150 VUs, 1077 complete and 0 interrupted iterations
authList      [  61% ] 100 VUs  0m36.9s/1m0s
myResources   [  61% ] 50 VUs   0m36.9s/1m0s

running (0m38.0s), 150/150 VUs, 1107 complete and 0 interrupted iterations
authList      [  63% ] 100 VUs  0m37.8s/1m0s
myResources   [  63% ] 50 VUs   0m37.8s/1m0s

running (0m39.0s), 150/150 VUs, 1133 complete and 0 interrupted iterations
authList      [  65% ] 100 VUs  0m38.8s/1m0s
myResources   [  65% ] 50 VUs   0m38.8s/1m0s

running (0m40.0s), 150/150 VUs, 1165 complete and 0 interrupted iterations
authList      [  66% ] 100 VUs  0m39.9s/1m0s
myResources   [  66% ] 50 VUs   0m39.9s/1m0s

running (0m41.0s), 150/150 VUs, 1196 complete and 0 interrupted iterations
authList      [  68% ] 100 VUs  0m40.8s/1m0s
myResources   [  68% ] 50 VUs   0m40.8s/1m0s

running (0m42.0s), 150/150 VUs, 1231 complete and 0 interrupted iterations
authList      [  70% ] 100 VUs  0m41.8s/1m0s
myResources   [  70% ] 50 VUs   0m41.8s/1m0s

running (0m43.0s), 150/150 VUs, 1264 complete and 0 interrupted iterations
authList      [  71% ] 100 VUs  0m42.9s/1m0s
myResources   [  71% ] 50 VUs   0m42.9s/1m0s

running (0m44.0s), 150/150 VUs, 1293 complete and 0 interrupted iterations
authList      [  73% ] 100 VUs  0m43.9s/1m0s
myResources   [  73% ] 50 VUs   0m43.9s/1m0s

running (0m45.0s), 150/150 VUs, 1324 complete and 0 interrupted iterations
authList      [  75% ] 100 VUs  0m44.9s/1m0s
myResources   [  75% ] 50 VUs   0m44.9s/1m0s

running (0m46.0s), 150/150 VUs, 1349 complete and 0 interrupted iterations
authList      [  76% ] 100 VUs  0m45.9s/1m0s
myResources   [  76% ] 50 VUs   0m45.9s/1m0s

running (0m47.0s), 150/150 VUs, 1378 complete and 0 interrupted iterations
authList      [  78% ] 100 VUs  0m46.9s/1m0s
myResources   [  78% ] 50 VUs   0m46.9s/1m0s

running (0m48.0s), 150/150 VUs, 1412 complete and 0 interrupted iterations
authList      [  80% ] 100 VUs  0m47.9s/1m0s
myResources   [  80% ] 50 VUs   0m47.9s/1m0s

running (0m49.0s), 150/150 VUs, 1441 complete and 0 interrupted iterations
authList      [  81% ] 100 VUs  0m48.9s/1m0s
myResources   [  81% ] 50 VUs   0m48.9s/1m0s

running (0m50.0s), 150/150 VUs, 1472 complete and 0 interrupted iterations
authList      [  83% ] 100 VUs  0m49.9s/1m0s
myResources   [  83% ] 50 VUs   0m49.9s/1m0s

running (0m51.0s), 150/150 VUs, 1504 complete and 0 interrupted iterations
authList      [  85% ] 100 VUs  0m50.9s/1m0s
myResources   [  85% ] 50 VUs   0m50.9s/1m0s

running (0m52.0s), 150/150 VUs, 1534 complete and 0 interrupted iterations
authList      [  86% ] 100 VUs  0m51.9s/1m0s
myResources   [  86% ] 50 VUs   0m51.9s/1m0s

running (0m53.0s), 150/150 VUs, 1560 complete and 0 interrupted iterations
authList      [  88% ] 100 VUs  0m52.8s/1m0s
myResources   [  88% ] 50 VUs   0m52.8s/1m0s

running (0m54.0s), 150/150 VUs, 1589 complete and 0 interrupted iterations
authList      [  90% ] 100 VUs  0m53.8s/1m0s
myResources   [  90% ] 50 VUs   0m53.8s/1m0s

running (0m55.0s), 150/150 VUs, 1619 complete and 0 interrupted iterations
authList      [  91% ] 100 VUs  0m54.8s/1m0s
myResources   [  91% ] 50 VUs   0m54.9s/1m0s

running (0m56.0s), 150/150 VUs, 1653 complete and 0 interrupted iterations
authList      [  93% ] 100 VUs  0m55.8s/1m0s
myResources   [  93% ] 50 VUs   0m55.8s/1m0s

running (0m57.0s), 150/150 VUs, 1686 complete and 0 interrupted iterations
authList      [  95% ] 100 VUs  0m56.8s/1m0s
myResources   [  95% ] 50 VUs   0m56.8s/1m0s

running (0m58.0s), 150/150 VUs, 1710 complete and 0 interrupted iterations
authList      [  96% ] 100 VUs  0m57.9s/1m0s
myResources   [  96% ] 50 VUs   0m57.9s/1m0s

running (0m59.0s), 150/150 VUs, 1733 complete and 0 interrupted iterations
authList      [  98% ] 100 VUs  0m58.9s/1m0s
myResources   [  98% ] 50 VUs   0m58.9s/1m0s

running (1m00.0s), 150/150 VUs, 1762 complete and 0 interrupted iterations
authList      [ 100% ] 100 VUs  0m59.9s/1m0s
myResources   [ 100% ] 50 VUs   0m59.9s/1m0s

running (1m01.0s), 123/150 VUs, 1793 complete and 0 interrupted iterations
authList    ↓ [ 100% ] 100 VUs  1m0s
myResources ↓ [ 100% ] 50 VUs   1m0s

running (1m02.0s), 093/150 VUs, 1823 complete and 0 interrupted iterations
authList    ↓ [ 100% ] 100 VUs  1m0s
myResources ↓ [ 100% ] 50 VUs   1m0s

running (1m03.0s), 056/150 VUs, 1860 complete and 0 interrupted iterations
authList    ↓ [ 100% ] 100 VUs  1m0s
myResources ↓ [ 100% ] 50 VUs   1m0s

running (1m04.0s), 032/150 VUs, 1884 complete and 0 interrupted iterations
authList    ↓ [ 100% ] 100 VUs  1m0s
myResources ↓ [ 100% ] 50 VUs   1m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    t_auth_list
    ✗ 'p(95)<500' p(95)=5.57s

    t_my_resources
    ✗ 'p(95)<500' p(95)=5.57s


  █ TOTAL RESULTS 

    checks_total.......: 1916    29.595349/s
    checks_succeeded...: 100.00% 1916 out of 1916
    checks_failed......: 0.00%   0 out of 1916

    ✓ auth list 200
    ✓ me 200

    CUSTOM
    t_auth_list....................: avg=4.87s min=388.71ms med=4.99s p(50)=4.99s p(95)=5.57s p(99)=9.52s max=10.48s
    t_my_resources.................: avg=4.87s min=412.75ms med=5s    p(50)=5s    p(95)=5.57s p(99)=9.56s max=14.5s 

    HTTP
    http_req_duration..............: avg=4.87s min=119.72ms med=4.99s p(50)=4.99s p(95)=5.57s p(99)=9.54s max=14.5s 
      { expected_response:true }...: avg=4.87s min=119.72ms med=4.99s p(50)=4.99s p(95)=5.57s p(99)=9.54s max=14.5s 
    http_req_failed................: 0.00%  0 out of 1917
    http_reqs......................: 1917   29.610795/s

    EXECUTION
    iteration_duration.............: avg=4.87s min=389.04ms med=4.99s p(50)=4.99s p(95)=5.57s p(99)=9.54s max=14.51s
    iterations.....................: 1916   29.595349/s
    vus............................: 32     min=32        max=150
    vus_max........................: 150    min=150       max=150

    NETWORK
    data_received..................: 33 MB  510 kB/s
    data_sent......................: 694 kB 11 kB/s



running (1m04.7s), 000/150 VUs, 1916 complete and 0 interrupted iterations
authList    ✓ [ 100% ] 100 VUs  1m0s
myResources ✓ [ 100% ] 50 VUs   1m0s
time="2026-09-05T11:44:08Z" level=error msg="thresholds on metrics 't_auth_list, t_my_resources' have been crossed"